#include<iostream>
#include<cmath>
#include<ctime>
#include"cabecera.h"

using namespace std;

void mostrarMario();
void mostrarLuigi();

int main()
{
    long int u = 23451234;
    long int v = 57894567;
    
    clock_t ini, fin;
    
    /* TODO Descomentar cuando haya implementado mario4
    mostrarMario();
    ini = clock();
    long int resultado = mario4(u,v,4);
    fin = clock();
    cout << "Resultado: " << resultado << endl;
    cout << "Tiempo: " << ((double)(fin-ini))/CLOCKS_PER_SEC << " s" << endl << endl;
    */

    /* TODO Descomentar cuando haya implementado luigi3
    mostrarLuigi();
    ini = clock();
    resultado = luigi3(u,v,4);
    fin = clock();
    cout << "Resultado: " << resultado << endl;
    cout << "Tiempo: " << ((double)(fin-ini))/CLOCKS_PER_SEC << " s" << endl << endl;
    */
    return 0;
}


void mostrarMario() {
    cout << R"(                                                      
⬜⬜⬜🟥🟥🟥🟥🟥⬜⬜⬜️⬜️
⬜⬜🟥🟥🟥🟥🟥🟥🟥🟥🟥⬜
⬜⬜🟫🟫🟫🟧🟧⬛️🟧⬜⬜⬜
⬜🟫🟧🟫🟧🟧🟧⬛️🟧🟧🟧⬜
⬜🟫🟧🟫🟫🟧🟧🟧⬛️🟧🟧🟧
⬜🟫🟫🟧🟧🟧🟧⬛️⬛️⬛️⬛️⬜
⬜⬜⬜🟧🟧🟧🟧🟧🟧🟧⬜⬜
⬜⬜🟥🟥🟦🟥🟥🟥🟥⬜⬜⬜
⬜🟥🟥🟥🟦🟥🟥🟦🟥🟥🟥⬜
🟥🟥🟥🟥🟦🟦🟦🟦🟥🟥🟥🟥
🟧🟧🟥🟦🟨🟦🟦🟨🟦🟥🟧🟧
🟧🟧🟧🟦🟦🟦🟦🟦🟦🟧🟧🟧
🟧🟧🟦🟦🟦🟦🟦🟦🟦🟦🟧🟧
⬜️⬜️🟦🟦🟦⬜️⬜️🟦🟦🟦⬜⬜
⬜️🟫🟫🟫⬜️⬜️⬜️⬜️🟫🟫🟫⬜
🟫🟫🟫🟫⬜️⬜️⬜️⬜️🟫🟫🟫🟫
)" << endl;
}

void mostrarLuigi() {
    cout << R"(                                                      
⬜⬜⬜🟩🟩🟩🟩🟩⬜⬜⬜️⬜️
⬜⬜🟩🟩🟩🟩🟩🟩🟩🟩🟩⬜
⬜⬜🟫🟫🟫🟧🟧⬛️🟧⬜⬜⬜
⬜🟫🟧🟫🟧🟧🟧⬛️🟧🟧🟧⬜
⬜🟫🟧🟫🟫🟧🟧🟧⬛️🟧🟧🟧
⬜🟫🟫🟧🟧🟧🟧⬛️⬛️⬛️⬛️⬜
⬜⬜⬜🟧🟧🟧🟧🟧🟧🟧⬜⬜
⬜⬜🟩🟩🟦🟩🟩🟩🟩⬜⬜⬜
⬜🟩🟩🟩🟦🟩🟩🟦🟩🟩🟩⬜
🟩🟩🟩🟩🟦🟦🟦🟦🟩🟩🟩🟩
🟧🟧🟩🟦🟨🟦🟦🟨🟦🟩🟧🟧
🟧🟧🟧🟦🟦🟦🟦🟦🟦🟧🟧🟧
🟧🟧🟦🟦🟦🟦🟦🟦🟦🟦🟧🟧
⬜️⬜️🟦🟦🟦⬜️⬜️🟦🟦🟦⬜⬜
⬜️🟫🟫🟫⬜️⬜️⬜️⬜️🟫🟫🟫⬜
🟫🟫🟫🟫⬜️⬜️⬜️⬜️🟫🟫🟫🟫
)" << endl;
}
